proposal.tex
% Created 2016-12-12 Mon 13:46
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Willian Ver Valen Paiva}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Willian Ver Valen Paiva},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.1)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{crosscutting concerns}
\label{sec:orgfdc5866}
\subsection{what is it}
\label{sec:org8aa4fdf}
\subsection{options to deal with it}
\label{sec:org07f5d17}
\begin{itemize}
\item TemplateMetaprogramming, augmented with PolicyObjects (such as StandardTemplateLibrary allocators)
\item MetaObjectProtocols, in particular things like before functions, after functions, etc.
\item Decorators (both DecoratorPattern and the language feature in Java), delegation in general.
\item TemplateMethodPattern (i.e. use of HookMethods)
\item RPC tools
\item Many of the CreationalPatterns can be used to allow variation of some cross-cutting concern at runtime.
\item MultipleInheritance and MixIns
\item ContextObject or ExplicitManagementOfImplicitContext
\item A programming paradigm dealing with this stuff is AspectOrientedProgramming.
\end{itemize}

bad example of dealing:
\begin{itemize}
\item GrandCentralStation (aggregating lots of independent domain functionality into a BigBallOfMud just so the CrossCuttingConcern(s) can be dealt with in one place).
\end{itemize}

\section{context-oriented aproach}
\label{sec:orgd8d9240}
\subsection{pros}
\label{sec:org5d82f5c}
\subsection{cons}
\label{sec:org68f9bea}
\subsection{public acceptance}
\label{sec:orgbb758bc}
\section{aspect-oriented vs context-oriencted}
\label{sec:org6790733}
\subsection{pros}
\label{sec:orgc156bd0}
\subsection{cons}
\label{sec:orgdd9f669}
\subsection{public acceptance}
\label{sec:org99b87bf}
\section{feature-oriented vs context-oriented}
\label{sec:org72d320e}
\subsection{pros}
\label{sec:org19f0d1e}
\subsection{cons}
\label{sec:org9838e9d}
\subsection{public acceptance}
\label{sec:org6b12053}
\section{develop the soldier app in contextJ}
\label{sec:org1d46151}
\subsection{compare with the solution made in class}
\label{sec:org50cc8df}
\subsection{pros}
\label{sec:orgb02144d}
\subsection{cons}
\label{sec:orge242f84}
\end{document}